'use client';

import { FormProvider, useForm } from 'react-hook-form';
import { z } from 'zod';
import { zodResolver } from '@hookform/resolvers/zod';
import { ResetPasswordStepProvider } from './hooks/reset-password-step.hook';
import StepRenderer from './ui/step-renderer';
import { VerifyEmailCodeProvider } from './hooks/verify-email-code.hook';

const schema = z
  .object({
    email: z
      .email('이메일 형식이 일치하지 않습니다.')
      .min(1, '이메일을 입력해주세요.'),
    code: z.string().min(6, '인증코드를 6자리를 입력해주세요.'),
    password: z
      .string()
      .regex(
        /^(?=.*[a-zA-Z])(?=.*\d)(?=.*[!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]).{8,}$/,
        '비밀번호는 영문, 숫자, 특수문자를 포함한 8자리 이상이어야 합니다.'
      ),
    passwordConfirm: z.string().min(1, '비밀번호를 입력해주세요.'),
  })
  .superRefine((data, ctx) => {
    const { password, passwordConfirm } = data;
    if (password !== passwordConfirm) {
      ctx.addIssue({
        code: 'custom',
        message: '비밀번호가 일치하지 않습니다.',
        path: ['passwordConfirm'],
      });
    }
  });

export default function ResetPasswordPage() {
  const form = useForm({
    resolver: zodResolver(schema),
    mode: 'onChange',
  });

  const onSubmit = () => {};

  return (
    <main className="flex flex-col items-center justify-center h-svh">
      <div className="lg:min-h-[672px] max-w-md w-full px-8 py-10 rounded-4xl shadow-[0_0_18px_0_rgba(0,0,0,0.08)] flex flex-col items-center">
        {/* TODO: 로고 이미지 적용*/}
        <div className="mt-8 text-6xl font-bold text-primary-500">
          <svg
            width="120"
            height="33"
            viewBox="0 0 120 33"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M5.86335 12.6905C6.6893 11.5876 7.46884 11.037 8.79422 10.4976C10.03 10.0142 12.3093 10.0142 13.8732 10.0142V14.5281H12.8248C11.0064 14.5441 9.26482 15.2724 7.97786 16.5594C6.86858 17.6687 6.17388 19.1157 5.993 20.6572C5.94018 20.9213 5.89696 21.203 5.86335 21.5055V32.9153H0V10.0142H5.86335V12.6905Z"
              fill="currentColor"
            />
            <path
              d="M36.2905 26.1585C35.0227 27.5463 33.1979 28.4171 31.1698 28.4171C28.1781 28.4171 25.6298 26.5235 24.6566 23.8695H42.6052C42.7573 23.0868 42.8341 22.2656 42.8341 21.4077C42.8341 19.1283 42.3107 17.1162 41.2638 15.373C40.2442 13.6299 38.8388 12.2885 37.0476 11.3505C35.2564 10.3853 33.2587 9.90186 31.053 9.90186C28.8472 9.90186 26.8496 10.3853 25.0584 11.3505C23.2672 12.2885 21.8474 13.6299 20.8005 15.373C19.7809 17.1162 19.2703 19.1283 19.2703 21.4077C19.2703 23.687 19.7665 25.6991 20.7589 27.4423C21.7786 29.1854 23.1696 30.5396 24.9335 31.5064C26.6975 32.4444 28.6807 32.915 30.8865 32.915C33.0923 32.915 35.1299 32.446 36.9227 31.5064C38.7411 30.5412 40.1753 29.187 41.2222 27.4423C41.4767 27.0293 41.6992 26.6019 41.8945 26.1585H36.2905ZM31.1698 14.5423C34.1359 14.5423 36.6682 16.4055 37.659 19.0242H24.6806C25.6714 16.4055 28.2037 14.5423 31.1698 14.5423Z"
              fill="currentColor"
            />
            <path
              d="M71.7645 0.580566H66.002V11.3084C64.2124 10.3464 62.2179 9.8646 60.0154 9.8646C57.8128 9.8646 55.812 10.348 54.0208 11.3132C52.2296 12.2512 50.8098 13.5926 49.7629 15.3358C48.7433 17.0789 48.2327 19.091 48.2327 21.3704C48.2327 23.6498 48.7289 25.6619 49.7213 27.405C50.741 29.1482 52.132 30.5024 53.8959 31.4692C55.6599 32.4072 57.6432 32.8778 59.8489 32.8778C62.0547 32.8778 64.0924 32.4088 65.8851 31.4692C65.9235 31.4484 65.962 31.426 66.002 31.4051V32.9146H71.7645V0.580566ZM60.1338 28.3798C56.3034 28.3798 53.1964 25.2745 53.1964 21.4424C53.1964 17.6104 56.3018 14.505 60.1338 14.505C63.9643 14.505 67.0712 17.6104 67.0712 21.4424C67.0712 25.2745 63.9659 28.3798 60.1338 28.3798Z"
              fill="currentColor"
            />
            <path
              fillRule="evenodd"
              clipRule="evenodd"
              d="M88.9463 9.90137C91.1504 9.90137 93.1497 10.3848 94.9409 11.35C96.7321 12.288 98.1375 13.6294 99.1571 15.3725C100.204 17.1157 100.727 19.1278 100.727 21.4072C100.727 23.6866 100.19 25.6986 99.1155 27.4418C98.0686 29.1849 96.6344 30.5391 94.816 31.5059C93.0249 32.444 91.0128 32.9146 88.7798 32.9146C86.5468 32.9146 84.5908 32.4456 82.8268 31.5059C81.0629 30.5407 79.6719 29.1849 78.6522 27.4418C77.6598 25.6986 77.1636 23.6866 77.1636 21.4072C77.1636 19.1278 77.6726 17.1157 78.6922 15.3725C79.7391 13.6294 81.1589 12.288 82.9501 11.35C84.7413 10.3848 86.7389 9.90137 88.9447 9.90137H88.9463ZM89.0631 14.5434C85.2327 14.5434 82.1257 17.6487 82.1257 21.4808C82.1257 25.3113 85.2311 28.4182 89.0631 28.4182C92.8952 28.4182 96.0005 25.3129 96.0005 21.4808C96.0005 17.6487 92.8952 14.5434 89.0631 14.5434Z"
              fill="currentColor"
            />
            <path
              d="M112.026 14.3944V26.049C112.026 26.8222 112.207 27.3888 112.57 27.7474C112.961 28.0787 113.603 28.2452 114.496 28.2452H119.999V32.9144H113.534C108.596 32.9144 106.126 30.7599 106.126 26.009V14.396H106.147V9.8516H106.126V5.16797H112.028V9.8516H120.001V14.396H112.028L112.026 14.3944Z"
              fill="currentColor"
            />
          </svg>
        </div>
        <h1 className="mt-9 text-3xl font-bold text-gray-800">
          비밀번호 재설정
        </h1>

        <VerifyEmailCodeProvider>
          <ResetPasswordStepProvider>
            <FormProvider {...form}>
              <form
                onSubmit={form.handleSubmit(onSubmit)}
                className="flex flex-col size-full"
              >
                <StepRenderer />
              </form>
            </FormProvider>
          </ResetPasswordStepProvider>
        </VerifyEmailCodeProvider>
      </div>
    </main>
  );
}
